serverTest/jmeter/echo_load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Echo Server Load Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- Concurrent client count, port, ramp-up and run duration are all supplied
           on the command line by run_load_tests.ps1 via -J properties, with the
           defaults below used when the plan is opened in the GUI. The run is
           TIME-bounded (a fixed duration per cell) rather than loop-bounded, so a
           slow single-threaded server does not take minutes to finish 500 clients:
           every strategy is measured over the same wall-clock window. -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Echo Clients" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(clients,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,2)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,20)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- One echo request = open a fresh TCP connection, send a 4+ char word
             ("quit") so the server triggers its 100 ms overhead, read the echo
             back until the server closes the socket. Re-use is off so every
             sample pays the full per-connection cost the strategies differ on. -->
        <TCPSampler guiclass="TCPSamplerGui" testclass="TCPSampler" testname="Echo TCP Request" enabled="true">
          <stringProp name="TCPSampler.server">${__P(host,localhost)}</stringProp>
          <stringProp name="TCPSampler.port">${__P(port,5000)}</stringProp>
          <boolProp name="TCPSampler.reUseConnection">false</boolProp>
          <boolProp name="TCPSampler.closeConnection">true</boolProp>
          <boolProp name="TCPSampler.nodelay">true</boolProp>
          <stringProp name="TCPSampler.ctimeout">3000</stringProp>
          <stringProp name="TCPSampler.timeout">10000</stringProp>
          <stringProp name="TCPSampler.classname">TCPClientImpl</stringProp>
          <stringProp name="TCPSampler.request">quit</stringProp>
        </TCPSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>